---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException
source: html/bd20becb-e1bb-4280-1f36-1c844c76861d.htm
---
# ForbiddenForDynamicUpdateException Members

Retrieves data needed to serialize the target object.